<!DOCTYPE html>
<html lang="en">

<!-- Head tag -->
<head>
    <!-- hexo-inject:begin --><!-- hexo-inject:end --><meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="google-site-verification" content="xBT4GhYoi5qRD5tr338pgPM5OWHHIDR6mNg1a3euekI" />
    <meta name="viewport" content="width=device-width, initial-scale=1">
    <meta name="description" content="两只bug鸣翠柳，一行代码上西天">
    <meta name="keyword"  content="算法 大数据 系统架构 机器学习 Java技术 中间件 高并发">
    <link rel="shortcut icon" href="/img/favicon.ico">
    <meta name="baidu-site-verification" content="I9urFMjvnH" />
<meta name="google-site-verification" content="kOhH4Y18J0KFSbfkCwJhRGpHFvY1aoSeyVci6XDCxAs" />
    <title>
        
          《架构真经》读书笔记 - Kris的博客 | Kris&#39; Blog
        
    </title>

    <link rel="canonical" href="kriszhang.com/arch-scale/">

    <!-- Bootstrap Core CSS -->
    <link rel="stylesheet" href="/css/bootstrap.min.css">

    <!-- Custom CSS -->
    <link rel="stylesheet" href="/css/hux-blog.min.css">

    <!-- Pygments Github CSS -->
    <link rel="stylesheet" href="/css/syntax.css">

    <!-- Custom Fonts -->
    <!-- <link href="http://maxcdn.bootstrapcdn.com/font-awesome/4.3.0/css/font-awesome.min.css" rel="stylesheet" type="text/css"> -->
    <!-- Hux change font-awesome CDN to qiniu -->
    <link href="http://cdn.staticfile.org/font-awesome/4.2.0/css/font-awesome.min.css" rel="stylesheet" type="text/css">


    <!-- Hux Delete, sad but pending in China
    <link href='http://fonts.googleapis.com/css?family=Lora:400,700,400italic,700italic' rel='stylesheet' type='text/css'>
    <link href='http://fonts.googleapis.com/css?family=Open+Sans:300italic,400italic,600italic,700italic,800italic,400,300,600,700,800' rel='stylesheet' type='text/
    css'>
    -->


    <!-- HTML5 Shim and Respond.js IE8 support of HTML5 elements and media queries -->
    <!-- WARNING: Respond.js doesn't work if you view the page via file:// -->
    <!--[if lt IE 9]>
        <script src="https://oss.maxcdn.com/libs/html5shiv/3.7.0/html5shiv.js"></script>
        <script src="https://oss.maxcdn.com/libs/respond.js/1.4.2/respond.min.js"></script>
    <![endif]-->

    <!-- ga & ba script hoook -->
    <script></script><!-- hexo-inject:begin --><!-- hexo-inject:end -->
</head>


<!-- hack iOS CSS :active style -->
<body ontouchstart="">
  <!-- hexo-inject:begin --><!-- hexo-inject:end --><div id='wx_pic' style='margin:0 auto;display:none;'>
    <img src='undefined' />
  </div>

    <!-- Navigation -->
<nav class="navbar navbar-default navbar-custom navbar-fixed-top">
    <div class="container-fluid">
        <!-- Brand and toggle get grouped for better mobile display -->
        <div class="navbar-header page-scroll">
            <button type="button" class="navbar-toggle">
                <span class="sr-only">Toggle navigation</span>
                <span class="icon-bar"></span>
                <span class="icon-bar"></span>
                <span class="icon-bar"></span>
            </button>
            <a class="navbar-brand" href="/">Kris&#39; Blog</a>
        </div>

        <!-- Collect the nav links, forms, and other content for toggling -->
        <!-- Known Issue, found by Hux:
            <nav>'s height woule be hold on by its content.
            so, when navbar scale out, the <nav> will cover tags.
            also mask any touch event of tags, unfortunately.
        -->
        <div id="huxblog_navbar">
            <div class="navbar-collapse">
                <ul class="nav navbar-nav navbar-right">
                    <li>
                        <a href="/">Home</a>
                    </li>

                    

                        
                    

                        
                        <li>
                            <a href="/about/">About</a>
                        </li>
                        
                    

                        
                        <li>
                            <a href="/tags/">Tags</a>
                        </li>
                        
                    
                    
                </ul>
            </div>
        </div>
        <!-- /.navbar-collapse -->
    </div>
    <!-- /.container -->
</nav>
<script>
    // Drop Bootstarp low-performance Navbar
    // Use customize navbar with high-quality material design animation
    // in high-perf jank-free CSS3 implementation
    var $body   = document.body;
    var $toggle = document.querySelector('.navbar-toggle');
    var $navbar = document.querySelector('#huxblog_navbar');
    var $collapse = document.querySelector('.navbar-collapse');

    $toggle.addEventListener('click', handleMagic)
    function handleMagic(e){
        if ($navbar.className.indexOf('in') > 0) {
        // CLOSE
            $navbar.className = " ";
            // wait until animation end.
            setTimeout(function(){
                // prevent frequently toggle
                if($navbar.className.indexOf('in') < 0) {
                    $collapse.style.height = "0px"
                }
            },400)
        }else{
        // OPEN
            $collapse.style.height = "auto"
            $navbar.className += " in";
        }
    }
</script>


    <!-- Main Content -->
    
<!-- Image to hack wechat -->
<!-- <img src="kriszhang.com/img/icon_wechat.png" width="0" height="0"> -->
<!-- <img src="{{ site.baseurl }}/{% if page.header-img %}{{ page.header-img }}{% else %}{{ site.header-img }}{% endif %}" width="0" height="0"> -->

<!-- Post Header -->
<style type="text/css">
    header.intro-header{
        background-image: url('head.jpg')
    }
</style>
<header class="intro-header" >

    <div class="container">
        <div class="row">
            <div class="col-lg-8 col-lg-offset-2 col-md-10 col-md-offset-1">
                <div class="post-heading">
                    <div class="tags">
                        
                          <a class="tag" href="/tags/#架构" title="架构">架构</a>
                        
                    </div>
                    <h1>《架构真经》读书笔记</h1>
                    <h2 class="subheading"></h2>
                    <span class="meta">
                        Posted by kris.zhang on
                        2018-12-17
                    </span>
                </div>
            </div>
        </div>
    </div>
    <script>
    var _hmt = _hmt || [];
    (function() {
      var hm = document.createElement("script");
      hm.src = "//hm.baidu.com/hm.js?e06e6395b235a8f00dd89c228abbb3f1";
      var s = document.getElementsByTagName("script")[0];
      s.parentNode.insertBefore(hm, s);
    })();
    </script>
</header>

<!-- Post Content -->
<article>
  <div id='wx_pic' style='margin:0 auto;display:none;'>
    <img src='undefined' />
  </div>
    <div class="container">
        <div class="row">

    <!-- Post Container -->
            <div class="
                col-lg-8 col-lg-offset-2
                col-md-10 col-md-offset-1
                post-container">

                <h2 id="&#x5927;&#x9053;&#x81F3;&#x7B80;"><a href="#&#x5927;&#x9053;&#x81F3;&#x7B80;" class="headerlink" title="&#x5927;&#x9053;&#x81F3;&#x7B80;"></a>&#x5927;&#x9053;&#x81F3;&#x7B80;</h2><p>&#x6211;&#x5B66;&#x5230;&#x4E86;&#x51E0;&#x70B9;&#x601D;&#x8DEF;&#xFF1A;</p>
<p>&#x2460; 5&#x4E2A;&#x539F;&#x5219;&#xFF0C;&#x5176;&#x5B9E;&#x8BF4;&#x767D;&#x4E86;&#x5C31;&#x662F;&#x8981;&#x65B9;&#x6848;&#x7B80;&#x5355;&#x3002;&#x5176;&#x4E2D;&#x8FC7;&#x6E21;&#x8BBE;&#x8BA1;&#x6709;&#x51E0;&#x4E2A;&#x4F8B;&#x5B50;&#x4E3E;&#x5F97;&#x6BD4;&#x8F83;&#x597D;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x55B7;&#x4EBA;&#xFF0C;&#x6BD4;&#x5982;&#x4F60;&#x8BF4;PD&#xFF0C;&#x4F60;&#x8FD9;&#x4E2A;&#x65B9;&#x6848;&#x592A;&#x590D;&#x6742;&#xFF0C;&#x8FC7;&#x6E21;&#x8BBE;&#x8BA1;&#xFF0C;&#x5C31;&#x50CF;&#x4F60;&#x8BBE;&#x8BA1;&#x652F;&#x6301;100&#x5EA6;&#x7684;&#x7A7A;&#x8C03;&#x4E00;&#x6837;&#x3002;</p>
<p>&#x2461; DID&#x539F;&#x5219;&#xFF0C;&#x8BBE;&#x8BA1;&#x3001;&#x5B9E;&#x65BD;&#x3001;&#x90E8;&#x7F72;&#xFF0C;&#x5C42;&#x5C42;&#x9012;&#x8FDB;&#xFF0C;&#x8BBE;&#x8BA1;&#x7684;&#x65F6;&#x5019;&#x8003;&#x8651;&#x5F88;&#x591A;&#xFF0C;&#x53EF;&#x4EE5;&#x968F;&#x4FBF;&#x8111;&#x66B4;&#xFF0C;&#x628A;&#x672A;&#x6765;&#x89C4;&#x5212;&#x597D;&#xFF0C;&#x4F46;&#x662F;&#x5B9E;&#x65BD;&#xFF08;&#x5199;&#x4EE3;&#x7801;&#xFF09;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x8981;&#x7528;&#x6700;&#x7B80;&#x5355;&#x7684;&#x65B9;&#x6848;&#xFF0C;&#x4E4B;&#x540E;&#x90E8;&#x7F72;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x53EA;&#x8981;&#x6700;&#x4F4E;&#x90E8;&#x7F72;&#x6210;&#x672C;&#xFF0C;&#x968F;&#x7740;&#x4E1A;&#x52A1;&#x91CF;&#x589E;&#x52A0;&#xFF0C;&#x5219;&#x6162;&#x6162;&#x7EBF;&#x6027;&#x6269;&#x5C55;&#x3002;</p>
<p>&#x8FD9;&#x4E2A;&#x539F;&#x5219;&#x5F88;&#x91CD;&#x8981;&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x8BBE;&#x8BA1;&#x7CFB;&#x7EDF;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4E00;&#x5B9A;&#x8981;&#x9762;&#x5411;&#x672A;&#x6765;&#x53BB;&#x8003;&#x8651;&#x3002;</p>
<p>&#x2462; &#x51E0;&#x4E2A;&#x6280;&#x672F;&#x70B9;&#xFF0C;&#x4E00;&#x662F;&#x51CF;&#x5C11;&#x57DF;&#x540D;&#x89E3;&#x6790;&#xFF0C;&#x800C;&#x662F;&#x51CF;&#x5C11;&#x9875;&#x9762;&#xFF08;&#x5408;&#x5E76;&#x52A0;&#x8F7D;&#xFF09;&#xFF0C;&#x540C;&#x6784;&#x7F51;&#x7EDC;&#xFF08;&#x4E0D;&#x8981;&#x4EE5;&#x4E3A;&#x6709;&#x4E86;&#x534F;&#x8BAE;&#xFF0C;&#x5C31;&#x80FD;&#x4E3A;&#x6240;&#x6B32;&#x4E3A;&#xFF0C;&#x6709;&#x4E86;&#x534F;&#x8BAE;&#xFF0C;&#x540C;&#x65F6;&#x6709;&#x4E0D;&#x540C;&#x5B9E;&#x73B0;&#x7684;&#x8BDD;&#xFF0C;&#x517C;&#x5BB9;&#x6027;&#x6210;&#x4E3A;&#x707E;&#x96BE;&#xFF09;&#xFF0C;&#x6D4F;&#x89C8;&#x5668;&#x5E76;&#x53D1;&#x8FDE;&#x63A5;&#x6570;</p>
<p>&#x8FD9;&#x7AE0;&#x544A;&#x8BC9;&#x6211;&#x4EEC;&#x8BBE;&#x8BA1;&#x67B6;&#x6784;&#xFF0C;&#x4E00;&#x5B9A;&#x8981;&#x5C3D;&#x53EF;&#x80FD;&#x7684;&#x7B80;&#x5355;&#xFF0C;&#x4E0B;&#x6B21;&#x518D;&#x6709;&#x4EBA;&#x8FC7;&#x6E21;&#x8BBE;&#x8BA1;&#xFF0C;&#x7528;&#x8FD9;&#x4E2A;&#x539F;&#x5219;&#x53BB;&#x603C;&#x4ED6;&#x4EEC;&#x3002;</p>
<h2 id="&#x5206;&#x800C;&#x6CBB;&#x4E4B;"><a href="#&#x5206;&#x800C;&#x6CBB;&#x4E4B;" class="headerlink" title="&#x5206;&#x800C;&#x6CBB;&#x4E4B;"></a>&#x5206;&#x800C;&#x6CBB;&#x4E4B;</h2><p>&#x8FD9;&#x91CC;&#x6211;&#x5B66;&#x5230;&#x4E86;&#x4E00;&#x4E2A;&#xFF0C;&#x4F38;&#x7F29;&#x7ACB;&#x65B9;&#x4F53;&#x3002;&#x96C6;&#x6210;&#x4E86;&#x4E00;&#x4E9B;&#x6C34;&#x5E73;&#x6269;&#x5C55;&#x7684;&#x6280;&#x672F;&#x601D;&#x8DEF;&#x3002;xyz&#x8F74;&#xFF0C;x&#x8F74;&#x5373;&#x6C34;&#x5E73;&#x6269;&#x5C55;&#xFF0C;&#x6211;&#x7406;&#x89E3;&#x5176;&#x5B9E;&#x5C31;&#x662F;scale out&#xFF0C;&#x4E00;&#x4E2A;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x540E;&#x9762;&#xFF0C;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x6269;&#x5C55;&#x673A;&#x5668;&#x3002;&#x6216;&#x8005;&#x8BFB;&#x5199;&#x5206;&#x79BB;&#xFF0C;&#x591A;&#x52A0;&#x8BFB;&#x673A;&#x5668;&#xFF1B;y&#x8F74;&#xFF0C;&#x6211;&#x7406;&#x89E3;&#x662F;&#x5782;&#x76F4;&#x62C6;&#x5206;&#xFF0C;&#x5C31;&#x662F;soa&#x6216;&#x8005;&#x5FAE;&#x670D;&#x52A1;&#x5316;&#xFF0C;&#x5C06;&#x4E00;&#x4E2A;&#x4E1A;&#x52A1;&#x62C6;&#x5206;&#x4E3A;&#x591A;&#x4E2A;&#x5B50;&#x4E1A;&#x52A1;&#xFF0C;&#x76F4;&#x63A5;&#x901A;&#x8FC7;RPC&#x8C03;&#x7528;&#xFF1B;z&#x8F74;&#x5C31;&#x6BD4;&#x8F83;&#x9AD8;&#x7EA7;&#x4E86;&#xFF0C;&#x53EF;&#x4EE5;&#x7406;&#x89E3;&#x4E3A;&#x8682;&#x8681;&#x7684;&#x7528;&#x6237;&#x6C34;&#x5E73;&#x62C6;&#x5206;&#x6216;&#x8005;&#x903B;&#x8F91;zone&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x8FD9;&#x79CD;&#x6982;&#x5FF5;&#x53EF;&#x4EE5;&#x5C06;&#x7528;&#x6237;&#xFF08;&#x6216;&#x8005;&#x522B;&#x7684;&#x4EC0;&#x4E48;&#x4E1C;&#x897F;&#xFF09;&#x6309;&#x7167;&#x67D0;&#x4E2A;&#x539F;&#x5219;&#x5206;&#x6210;&#x591A;&#x4E2A;&#x3002;&#x6BCF;&#x4E2A;&#x90E8;&#x5206;&#x90FD;&#x662F;&#x72EC;&#x7ACB;&#x90E8;&#x7F72;&#x5355;&#x5143;&#xFF0C;&#x6BCF;&#x4E2A;&#x90E8;&#x7F72;&#x5355;&#x5143;&#xFF0C;&#x90FD;&#x662F;&#x4E00;&#x4E2A;&#x5C0F;&#x578B;&#x7684;&#x8682;&#x8681;&#x91D1;&#x670D;&#x3002;&#x8FD9;&#x6837;&#x5E26;&#x6765;&#x7684;&#x597D;&#x5904;&#x662F;&#x5BB9;&#x707E;&#x80FD;&#x529B;&#x5927;&#x5927;&#x589E;&#x5F3A;</p>
<h2 id="&#x6C34;&#x5E73;&#x6269;&#x5C55;"><a href="#&#x6C34;&#x5E73;&#x6269;&#x5C55;" class="headerlink" title="&#x6C34;&#x5E73;&#x6269;&#x5C55;"></a>&#x6C34;&#x5E73;&#x6269;&#x5C55;</h2><p>&#x51E0;&#x4E2A;&#x539F;&#x5219;&#xFF0C;&#x4E00;&#x4E2A;&#x662F;&#x7C7B;&#x4F3C;&#x8C37;&#x6B4C;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x7684;&#x539F;&#x5219;&#x4E00;&#x6837;&#xFF0C;&#x7528;&#x4FBF;&#x5B9C;&#x5EC9;&#x4EF7;&#x7684;&#x5927;&#x91CF;&#x5C0F;&#x673A;&#x5668;&#x4EE3;&#x66FF;&#x9AD8;&#x6027;&#x80FD;&#x6602;&#x8D35;&#x7684;&#x673A;&#x5668;&#x3002;&#x5176;&#x4E8C;&#x662F;&#x5229;&#x7528;&#x591A;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x80FD;&#x81EA;&#x5EFA;&#x5219;&#x7528;&#x516C;&#x6709;&#x4E91;&#x6216;&#x79C1;&#x6709;&#x4E91;&#xFF08;&#x4E91;&#x4E3B;&#x8981;&#x7528;&#x6765;&#x6240;&#x4F38;&#x7F29;&#x5F39;&#x6027;&#x8BA1;&#x7B97;&#xFF09;&#x3002;&#x8FD9;&#x4E2A;&#x4E00;&#x822C;&#x516C;&#x53F8;&#x6D89;&#x53CA;&#x4E0D;&#x5230;&#xFF0C;&#x7C7B;&#x4F3C;&#x963F;&#x91CC;&#xFF0C;&#x8682;&#x8681;&#x7B49;&#x4F1A;&#x6709;&#x8FD9;&#x4E9B;&#x4E1C;&#x897F;&#x3002;&#x7F8E;&#x56E2;&#x5E94;&#x8BE5;&#x4E5F;&#x6709;&#x3002;</p>
<p>&#x591A;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x7684;&#x95EE;&#x9898;&#x662F;&#x6570;&#x636E;&#x8DE8;&#x673A;&#x623F;&#x590D;&#x5236;&#x3002;</p>
<h2 id="&#x5148;&#x5229;&#x5176;&#x5668;"><a href="#&#x5148;&#x5229;&#x5176;&#x5668;" class="headerlink" title="&#x5148;&#x5229;&#x5176;&#x5668;"></a>&#x5148;&#x5229;&#x5176;&#x5668;</h2><p>&#x672C;&#x7AE0;&#x7ED9;&#x6211;&#x7684;&#x6700;&#x5927;&#x6536;&#x83B7;&#x4E4B;&#x4E00;&#x662F;&#xFF0C;&#x5728;&#x8FDB;&#x884C;&#x6570;&#x636E;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4E00;&#x5B9A;&#x8981;&#x5BF9;&#x4F60;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF0C;&#x6570;&#x636E;&#x91CF;&#xFF0C;&#x8BFB;&#x5199;&#x6BD4;&#xFF0C;&#x8BBF;&#x95EE;&#x91CF;&#xFF0C;&#x662F;&#x5426;&#x662F;&#x5F3A;&#x4E8B;&#x52A1;&#x7B49;&#x505A;&#x4E00;&#x4E2A;&#x5168;&#x9762;&#x7684;&#x8BC4;&#x4F30;&#xFF0C;&#x518D;&#x53BB;&#x9009;&#x62E9;&#x5408;&#x9002;&#x7684;&#x5B58;&#x50A8;&#x7CFB;&#x7EDF;&#xFF0C;&#x8FD9;&#x6837;&#x4E0D;&#x4F46;&#x80FD;&#x591F;&#x4F7F;&#x4F60;&#x7684;&#x7CFB;&#x7EDF;&#x540E;&#x671F;&#x6269;&#x5C55;&#x6027;&#x66F4;&#x5F3A;&#xFF0C;&#x4E5F;&#x80FD;&#x591F;&#x51CF;&#x5C11;&#x6210;&#x672C;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x5BF9;&#x4E8E;&#x67B6;&#x6784;&#x5E08;&#x6765;&#x8BB2;&#xFF0C;&#x4F60;&#x8981;&#x4E86;&#x89E3;&#x5404;&#x79CD;&#x5B58;&#x50A8;&#x7CFB;&#x7EDF;&#x7684;&#x6210;&#x672C;&#x5DEE;&#x5F02;&#x3001;&#x6280;&#x672F;&#x5B9E;&#x73B0;&#x7EC6;&#x8282;&#x5DEE;&#x5F02;&#x7B49;&#x7B49;&#x3002;&#x8BF8;&#x5982;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x3001;rdb&#x3001;nosql&#xFF08;&#x8868;&#x683C;&#x5B58;&#x50A8;&#x3001;&#x952E;&#x503C;&#x5B58;&#x50A8;&#x3001;&#x6587;&#x6863;&#x5B58;&#x50A8;&#xFF09;&#x3001;newsql&#x3001;&#x56FE;&#x6570;&#x636E;&#x5E93;&#x3001;&#x4F4D;&#x56FE;&#x6570;&#x636E;&#x5E93;&#x3001;&#x65F6;&#x5E8F;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x7B49;&#x7B49;&#x3002;&#x4F60;&#x90FD;&#x9700;&#x8981;&#x4E86;&#x89E3;&#x3002;</p>
<h2 id="&#x753B;&#x9F99;&#x70B9;&#x775B;"><a href="#&#x753B;&#x9F99;&#x70B9;&#x775B;" class="headerlink" title="&#x753B;&#x9F99;&#x70B9;&#x775B;"></a>&#x753B;&#x9F99;&#x70B9;&#x775B;</h2><p>&#x4E24;&#x4E2A;&#x6211;&#x89C9;&#x5F97;&#x6709;&#x7528;&#x7684;&#x539F;&#x5219;&#xFF0C;&#x5176;&#x4E00;&#x662F;&#x6C38;&#x8FDC;&#x4E0D;&#x8981;&#x5199;&#x540E;&#x8BFB;&#x3002;&#x8FD9;&#x4E2A;&#x4E00;&#x5B9A;&#x8981;&#x8BB0;&#x5F97;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x5728;&#x8BFB;&#x5199;&#x5206;&#x79BB;&#x573A;&#x666F;&#xFF0C;&#x5F88;&#x5927;&#x6982;&#x7387;&#x4F60;&#x8BFB;&#x5230;&#x7684;&#x662F;&#x65E7;&#x6570;&#x636E;&#xFF0C;&#x8FD8;&#x6709;&#x4E00;&#x79CD;&#x573A;&#x666F;&#x662F;&#x4F60;&#x53EF;&#x80FD;&#x5F88;&#x5C11;&#x9047;&#x5230;&#x7684;&#xFF0C;&#x4F46;&#x4E5F;&#x7B97;&#x662F;&#x5199;&#x540E;&#x8BFB;&#x3002;&#x5B9A;&#x65F6;&#x56DE;&#x8C03;&#x8BFB;+&#x5199;&#x3002;&#x6BD4;&#x5982;&#x6211;&#x6CE8;&#x518C;&#x4E00;&#x4E2A;&#x5B9A;&#x65F6;&#x56DE;&#x8C03;&#x5668;&#xFF0C;&#x8FD9;&#x4E2A;&#x56DE;&#x8C03;&#x4EE3;&#x7801;&#x4E2D;&#x4F1A;&#x67E5;&#x8BE2;&#x6570;&#x636E;x&#xFF0C;&#x7136;&#x540E;&#x505A;&#x4E00;&#x4E9B;&#x52A8;&#x4F5C;&#x3002;&#x4F46;&#x5728;&#x56DE;&#x8C03;&#x4EE3;&#x7801;&#x6267;&#x884C;&#x4E4B;&#x524D;&#x6267;&#x884C;&#x4E86;&#x5199;x&#x7684;&#x64CD;&#x4F5C;&#xFF0C;&#x800C;&#x540E;&#x9A6C;&#x4E0A;&#x5230;&#x8FBE;&#x5B9A;&#x65F6;&#x65F6;&#x95F4;&#xFF0C;&#x6B64;&#x65F6;&#x5C31;&#x4F1A;&#x53D1;&#x751F;&#x5199;&#x540E;&#x8BFB;&#x3002;</p>
<p>&#x5F53;&#x7136;&#x5199;&#x540E;&#x4E00;&#x5B9A;&#x8981;&#x8BFB;&#x7684;&#x573A;&#x666F;&#xFF0C;&#x6211;&#x4EEC;&#x4E5F;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5176;&#x4ED6;&#x65B9;&#x6848;&#x89E3;&#x51B3;&#xFF0C;&#x6BD4;&#x5982;&#x52A0;&#x5165;&#x7F13;&#x5B58;&#xFF0C;&#x6216;&#x8005;&#x76F4;&#x63A5;&#x8FD4;&#x56DE;bean&#xFF08;insert&#x4E4B;&#x524D;&#x7684;&#x539F;&#x59CB;&#x6570;&#x636E;&#xFF09;&#x7B49;&#x7B49;&#xFF0C;&#x5982;&#x679C;&#x4E00;&#x5B9A;&#x8981;&#x6821;&#x9A8C;&#xFF08;&#x6BD4;&#x5982;&#x6709;&#x76D1;&#x7BA1;&#x95EE;&#x9898;&#xFF09;&#xFF0C;&#x90A3;&#x4E48;&#x53EF;&#x4EE5;&#x91C7;&#x7528;&#x5F02;&#x6B65;&#x65E5;&#x5FD7;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x800C;&#x4E0D;&#x8981;&#x963B;&#x585E;&#x7528;&#x6237;&#x7EBF;&#x7A0B;&#x3002;</p>
<p>&#x7B2C;&#x4E8C;&#x4E2A;&#x539F;&#x5219;&#x662F;&#x653E;&#x5BBD;&#x65F6;&#x95F4;&#x7EA6;&#x675F;&#xFF0C;&#x5176;&#x5B9E;&#x6211;&#x4EEC;&#x6700;&#x5E38;&#x89C1;&#x7684;&#x573A;&#x666F;&#x5C31;&#x662F;&#x8981;&#x6700;&#x7EC8;&#x4E00;&#x81F4;&#x6027;&#x65B9;&#x6848;&#xFF0C;&#x8FD9;&#x4E2A;&#x662F;&#x820D;&#x5F03;&#x5B9E;&#x65F6;&#xFF0C;&#x53D8;&#x4E3A;&#x51C6;&#x5B9E;&#x65F6;&#xFF0C;&#x751A;&#x81F3;&#x662F;t+h&#x6216;t+1&#x7B49;&#x7B49;&#x3002;&#x5176;&#x5B9E;&#x9664;&#x4E86;&#x8FD9;&#x4E2A;&#x573A;&#x666F;&#xFF0C;&#x6211;&#x8FD9;&#x91CC;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x653E;&#x5BBD;&#x7EA6;&#x675F;&#x7684;&#x573A;&#x666F;&#xFF0C;&#x6BD4;&#x5982;&#x5230;&#x4E00;&#x4E2A;&#x65F6;&#x95F4;&#x70B9;&#x7ED9;&#x7528;&#x6237;&#x53D1;&#x67D0;&#x4E9B;&#x4E1C;&#x897F;&#xFF08;&#x4F18;&#x60E0;&#x3001;&#x77ED;&#x4FE1;&#x3001;push&#x901A;&#x77E5;&#xFF09;&#x7B49;&#x7B49;&#xFF0C;&#x4E00;&#x79CD;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x662F;&#x91C7;&#x7528;&#x72B6;&#x6001;+&#x65F6;&#x95F4;+&#x8BFB;&#x65B9;&#x6848;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x65E0;&#x6CD5;&#x4E3B;&#x52A8;&#x89E6;&#x53D1;&#xFF1B;&#x53E6;&#x4E00;&#x4E2A;&#x65B9;&#x6848;&#x662F;&#x5B9A;&#x65F6;&#x5668;&#xFF0C;&#x4F46;&#x662F;&#x5B9A;&#x65F6;&#x5668;&#x6709;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x65F6;&#x95F4;&#x7CBE;&#x5EA6;&#x603B;&#x4E0D;&#x662F;&#x90A3;&#x4E48;&#x7CBE;&#x786E;&#xFF0C;&#x5728;&#x52A0;&#x4E0A;&#x7CFB;&#x7EDF;&#x7A33;&#x5B9A;&#x6027;&#x7B49;&#x56E0;&#x7D20;&#xFF0C;&#x603B;&#x4F1A;&#x6709;&#x4E00;&#x5B9A;&#x7684;&#x5EF6;&#x8FDF;&#xFF0C;&#x6B64;&#x65F6;&#x600E;&#x4E48;&#x505A;&#x5462;&#xFF1F;&#x53EF;&#x4EE5;&#x5728;&#x4EA7;&#x54C1;&#x89C4;&#x5219;&#x4E0A;&#x505A;&#x4E00;&#x4E9B;&#x8C03;&#x6574;&#xFF0C;&#x6BD4;&#x5982;&#x4E0D;&#x8981;&#x90A3;&#x4E48;&#x7CBE;&#x786E;&#xFF0C;&#x4F8B;&#x5982;&#xFF1A;12&#xFF1A;00&#x4F60;&#x53EF;&#x4EE5;&#x8BF4;12&#xFF1A;00-12&#xFF1A;30&#x4E4B;&#x524D;&#x9001;&#x8FBE;&#x3002;&#x8FD9;&#x79CD;&#x4E5F;&#x662F;&#x653E;&#x5BBD;&#x65F6;&#x95F4;&#x7EA6;&#x675F;&#x7684;&#x4E00;&#x79CD;&#x529E;&#x6CD5;&#x3002;</p>
<h2 id="&#x7F13;&#x5B58;&#x4E3A;&#x738B;"><a href="#&#x7F13;&#x5B58;&#x4E3A;&#x738B;" class="headerlink" title="&#x7F13;&#x5B58;&#x4E3A;&#x738B;"></a>&#x7F13;&#x5B58;&#x4E3A;&#x738B;</h2><p>&#x4E0D;&#x60F3;&#x591A;&#x5570;&#x55E6;&#xFF0C;&#x6CA1;&#x4EC0;&#x4E48;&#x65B0;&#x4E1C;&#x897F;</p>
<h2 id="&#x524D;&#x8F66;&#x4E4B;&#x9274;"><a href="#&#x524D;&#x8F66;&#x4E4B;&#x9274;" class="headerlink" title="&#x524D;&#x8F66;&#x4E4B;&#x9274;"></a>&#x524D;&#x8F66;&#x4E4B;&#x9274;</h2><p>&#x8682;&#x8681;&#x91D1;&#x670D;&#x6709;&#x4E09;&#x677F;&#x65A7;&#xFF0C;&#x53EF;&#x56DE;&#x6EDA;&#x3001;&#x53EF;&#x76D1;&#x63A7;&#x3001;&#x53EF;&#x7070;&#x5EA6;&#x3002;&#x4EFB;&#x4F55;&#x53D1;&#x5E03;&#xFF0C;&#x4EFB;&#x4F55;&#x53D8;&#x66F4;&#x5FC5;&#x987B;&#x53EF;&#x56DE;&#x6EDA;&#x3001;&#x53EF;&#x76D1;&#x63A7;&#x3001;&#x53EF;&#x7070;&#x5EA6;&#x3002;&#x8FD9;&#x4E2A;&#x662F;&#x539F;&#x5219;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x5173;&#x4E8E;&#x77E5;&#x8BC6;&#x7684;&#x6DF1;&#x5EA6;&#x548C;&#x5E7F;&#x5EA6;&#xFF0C;&#x4F5C;&#x8005;&#x6709;&#x4E00;&#x4E2A;&#x6DF1;&#x5EA6;&#x591A;&#x95EE;why&#xFF0C;&#x5E7F;&#x5EA6;&#x4E5F;&#x8981;&#x8003;&#x8651;&#x4EBA;&#x5458;&#x3001;&#x7BA1;&#x7406;&#x3001;&#x6D41;&#x7A0B;&#x3002;&#x8FD9;&#x4E24;&#x70B9;&#x6BD4;&#x8F83;&#x6709;&#x6536;&#x83B7;&#x3002;&#x6DF1;&#x5EA6;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x591A;&#x95EE;why&#xFF0C;&#x5228;&#x6839;&#x95EE;&#x5E95;&#xFF0C;&#x81EA;&#x7136;&#x6DF1;&#x5EA6;&#x5C31;&#x6162;&#x6162;&#x6709;&#x4E86;&#xFF0C;&#x90FD;&#x6CA1;&#x6709;&#x5FC5;&#x8981;&#x4E13;&#x95E8;&#x53BB;&#x8BFB;&#x6709;&#x6DF1;&#x5EA6;&#x7684;&#x4E66;&#xFF08;&#x6709;&#x53EF;&#x80FD;&#x4F60;&#x8BFB;&#x4E0D;&#x61C2;&#xFF0C;&#x6D6A;&#x8D39;&#x65F6;&#x95F4;&#xFF09;&#xFF0C;&#x9488;&#x5BF9;&#x5177;&#x4F53;&#x4E8B;&#x60C5;&#xFF0C;&#x4F60;&#x628A;&#x4ED6;&#x6DF1;&#x6316;&#xFF0C;&#x5C31;&#x591F;&#x4F60;&#x7528;&#x7684;&#x4E86;&#x3002;&#x5E7F;&#x5EA6;&#x4E00;&#x822C;&#x6211;&#x4EEC;&#x90FD;&#x4EE5;&#x4E3A;&#x5404;&#x79CD;&#x65B0;&#x6280;&#x672F;&#x5565;&#x7684;&#xFF0C;&#x5176;&#x5B9E;&#x4E0D;&#x5168;&#x662F;&#xFF0C;&#x4F60;&#x8FD8;&#x8981;&#x770B;&#x4EBA;&#x5458;&#xFF08;&#x6BD4;&#x5982;&#x4EA7;&#x54C1;&#x8FD0;&#x8425;&#x7B49;&#xFF0C;&#x4F60;&#x4E5F;&#x8981;&#x6DF1;&#x5165;&#x4E86;&#x89E3;&#x4ED6;&#x4EEC;&#x7684;&#x601D;&#x7EF4;&#x548C;&#x5DE5;&#x4F5C;&#xFF09;&#xFF0C;&#x7BA1;&#x7406;&#xFF08;&#x4F60;&#x8981;&#x5B66;&#x4E60;&#x7BA1;&#x7406;&#x5B66;&#xFF0C;&#x5982;&#x4F55;&#x8DDF;&#x4EBA;&#x6253;&#x4EA4;&#x9053;&#x7B49;&#xFF09;&#xFF0C;&#x6D41;&#x7A0B;&#xFF08;&#x5982;&#x4F55;&#x4F18;&#x5316;&#x73B0;&#x6709;&#x6D41;&#x7A0B;&#xFF0C;&#x5982;&#x4F55;&#x80FD;&#x66F4;&#x597D;&#x7684;&#x4F18;&#x5316;&#x8D44;&#x6E90;&#x5229;&#x7528;&#xFF0C;&#x5982;&#x4F55;&#x80FD;&#x5408;&#x7406;&#x6392;&#x671F;&#x7B49;&#xFF09;</p>
<p>&#x5173;&#x4E8E;&#x590D;&#x76D8;&#xFF0C;&#x6709;&#x4E00;&#x4E2A;&#x6BD4;&#x8F83;&#x597D;&#x7684;&#x6D41;&#x7A0B;&#xFF1A;&#x65F6;&#x95F4;&#x8F74;&#xFF0C;&#x4F60;&#x5148;&#x68B3;&#x7406;&#x95EE;&#x9898;&#x53D1;&#x751F;&#x7684;&#x65F6;&#x95F4;&#x7EBF;&#x7D22;&#xFF1B;&#x660E;&#x786E;&#x95EE;&#x9898;&#xFF0C;&#x4F60;&#x591A;&#x95EE;why&#xFF0C;&#x627E;&#x5230;&#x54EA;&#x91CC;&#x9664;&#x4E86;&#x95EE;&#x9898;&#xFF1B;&#x786E;&#x5B9A;&#x65B9;&#x6848;&#xFF0C;&#x6700;&#x540E;&#x81F3;&#x5C11;&#x8981;&#x7ED9;&#x51FA;&#x4E00;&#x4E2A;&#x65B9;&#x6848;&#xFF0C;&#x5E76;&#x4E14;&#x8FD9;&#x4E2A;&#x65B9;&#x6848;&#x662F;&#x7B26;&#x5408;SMART&#x539F;&#x5219;&#x7684;&#x3002;&#x5177;&#x4F53;&#x7684;&#x3001;&#x53EF;&#x5EA6;&#x91CF;&#x3001;&#x53EF;&#x5B9E;&#x73B0;&#x7684;&#x3001;&#x73B0;&#x5B9E;&#x7684;&#x3001;&#x6709;&#x65F6;&#x95F4;&#x6027;&#x7684;&#x3002;</p>
<h2 id="&#x91CD;&#x4E2D;&#x4E4B;&#x91CD;"><a href="#&#x91CD;&#x4E2D;&#x4E4B;&#x91CD;" class="headerlink" title="&#x91CD;&#x4E2D;&#x4E4B;&#x91CD;"></a>&#x91CD;&#x4E2D;&#x4E4B;&#x91CD;</h2><p>&#x4E3B;&#x8981;&#x8BB2;db&#x4F7F;&#x7528;&#x4E0A;&#x7684;&#x4E00;&#x4E9B;&#x6CE8;&#x610F;&#x4E8B;&#x9879;&#x3002;&#x6BD4;&#x5982;&#xFF0C;&#x4E0D;&#x8981;&#x5199;&#x5B58;&#x50A8;&#x8FC7;&#x7A0B;&#xFF0C;&#x5C3D;&#x91CF;&#x4E0D;&#x8981;&#x8FDE;&#x8868;&#xFF0C;&#x4E0D;&#x8981;select * &#xFF0C;&#x8C28;&#x614E;&#x4F7F;&#x7528;&#x884C;&#x9501;&#xFF0C;&#x4E0D;&#x8981;&#x7528;&#x4E24;&#x9636;&#x6BB5;&#x63D0;&#x4EA4;&#x7B49;&#x7B49;&#x3002;&#x5176;&#x5B9E;&#x6211;&#x89C9;&#x5F97;&#x8FD9;&#x7AE0;&#x6CA1;&#x5565;&#x610F;&#x601D;&#xFF0C;&#x5F88;&#x591A;&#x8BB2;mysql&#x7684;&#x4E66;&#x90FD;&#x6709;&#x8FD9;&#x4E9B;&#x7ECF;&#x9A8C;&#xFF0C;&#x800C;&#x4E14;&#x8BB2;&#x7684;&#x66F4;&#x5168;&#x9762;&#x548C;&#x7EC6;&#x81F4;&#x3002;&#x8FD9;&#x91CC;&#x59D1;&#x4E14;&#x7B97;&#x4F5C;&#x8005;&#x4EE5;&#x81EA;&#x8EAB;&#x7ECF;&#x9A8C;&#x4F5C;&#x4E86;&#x4E00;&#x6B21;&#x6C47;&#x603B;&#x5427;&#x3002;</p>
<h2 id="&#x6709;&#x5907;&#x65E0;&#x60A3;"><a href="#&#x6709;&#x5907;&#x65E0;&#x60A3;" class="headerlink" title="&#x6709;&#x5907;&#x65E0;&#x60A3;"></a>&#x6709;&#x5907;&#x65E0;&#x60A3;</h2><p>&#x672C;&#x7AE0;&#x4E3B;&#x8981;&#x8BB2;&#x53EF;&#x7528;&#x6027;&#x5BF9;&#x53EF;&#x6269;&#x5C55;&#x6027;&#x7684;&#x5F71;&#x54CD;&#x3002;&#x6709;&#x51E0;&#x4E2A;&#x89C2;&#x70B9;&#xFF0C;&#x6545;&#x969C;&#x9694;&#x79BB;&#x6C38;&#x9053;+&#x5F00;&#x5173;+&#x653E;&#x5355;&#x70B9;&#x6545;&#x969C;&#xFF08;SPOF&#xFF09;&#xFF0C;&#x5176;&#x4E2D;SPOF&#x8FD9;&#x4E2A;&#x82F1;&#x6587;&#x7F29;&#x5199;&#x5F97;&#x8BB0;&#x5F97;&#xFF0C;&#x6BD4;&#x8F83;&#x725B;&#x903C;&#xFF0C;&#x62FF;&#x51FA;&#x53BB;&#x663E;&#x5F97;&#x5F88;&#x4E13;&#x4E1A;&#x3002;&#x53E6;&#x5916;&#x6CF3;&#x9053;&#x9694;&#x79BB;&#x5176;&#x5B9E;&#x65E0;&#x5904;&#x4E0D;&#x5728;&#x3002;&#x6BD4;&#x5982;&#x7EBF;&#x7A0B;&#x6C60;&#x4E2D;&#x7684;&#x6BCF;&#x4E2A;&#x7EBF;&#x7A0B;&#x662F;&#x9694;&#x79BB;&#x7684;&#xFF0C;&#x6BCF;&#x53F0;&#x670D;&#x52A1;&#x5668;&#x90FD;&#x662F;&#x9694;&#x79BB;&#x7684;&#xFF08;&#x5F7C;&#x6B64;&#x4E0D;&#x5F71;&#x54CD;&#xFF09;&#xFF0C;&#x96C6;&#x7FA4;&#x662F;&#x9694;&#x79BB;&#x7684;&#xFF0C;&#x673A;&#x623F;&#x662F;&#x9694;&#x79BB;&#x7684;&#xFF0C;&#x7B49;&#x7B49;&#x3002;&#x5176;&#x4E2D;&#x6545;&#x969C;&#x9694;&#x79BB;&#x7684;&#x51E0;&#x4E2A;&#x539F;&#x5219;&#x633A;&#x4E0D;&#x9519;&#x7684;&#xFF0C;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x8BF4;&#x670D;&#x522B;&#x4EBA;&#xFF1A;1&#xFF0C;&#x4E0D;&#x8981;&#x76F8;&#x4E92;&#x4F9D;&#x8D56;&#xFF0C;&#x72EC;&#x7ACB;&#x5DE5;&#x4F5C;&#xFF0C;2&#xFF0C;&#x51CF;&#x5C11;&#x5F02;&#x6B65;&#x8C03;&#x7528;&#x3002;&#x5176;&#x5B9E;&#x8BF4;&#x767D;&#x4E86;&#x5C31;&#x662F;&#x5C3D;&#x91CF;&#x964D;&#x4F4E;&#x4ED6;&#x4EEC;&#x7684;&#x76F8;&#x5173;&#x7CFB;&#x6570;&#xFF0C;cov(x,y)=0&#xFF0C;&#x8BA9;&#x5176;&#x4E0D;&#x76F8;&#x5173;&#xFF0C;&#x8FD9;&#x6837;&#x6545;&#x969C;&#x6982;&#x7387;&#x5C31;&#x53EF;&#x4EE5;&#x505A;&#x5230;p(x)*p(y)&#xFF0C;&#x5373;&#x6700;&#x6D88;&#x5316;&#x6545;&#x969C;&#x6982;&#x7387;&#x3002;</p>
<p>&#x53E6;&#x5916;&#xFF0C;&#x4E66;&#x4E2D;&#x7528;&#x7535;&#x8DEF;&#x56FE;&#x7C7B;&#x6BD4;&#x67B6;&#x6784;&#xFF0C;&#x6211;&#x89C9;&#x5F97;&#x8FD9;&#x4E2A;&#x601D;&#x60F3;&#x5F88;&#x6709;&#x610F;&#x601D;&#xFF0C;&#x5F88;&#x5F62;&#x8C61;&#xFF0C;&#x4EE5;&#x540E;&#x4F60;&#x5728;&#x8DDF;&#x522B;&#x4EBA;&#x8BB2;&#x67B6;&#x6784;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x501F;&#x9274;&#x3002;&#x4E32;&#x8054;&#x67B6;&#x6784;&#xFF0C;&#x5E76;&#x8054;&#x67B6;&#x6784;&#x7B49;&#x7B49;&#x3002;&#x6D41;&#x91CF;&#x5165;&#x53E3;&#x5C31;&#x50CF;&#x7535;&#x6C60;&#x4E00;&#x6837;&#x3002;</p>
<h2 id="&#x8D85;&#x7136;&#x7269;&#x5916;"><a href="#&#x8D85;&#x7136;&#x7269;&#x5916;" class="headerlink" title="&#x8D85;&#x7136;&#x7269;&#x5916;"></a>&#x8D85;&#x7136;&#x7269;&#x5916;</h2><p>&#x4E3B;&#x8981;&#x8BB2;&#x65E0;&#x72B6;&#x6001;&#x670D;&#x52A1;&#x3002;&#x4E3E;&#x4E24;&#x4E2A;&#x65E0;&#x72B6;&#x6001;&#x670D;&#x52A1;&#x7684;&#x4F8B;&#x5B50;&#x3002;&#x4E00;&#x662F;map-reduce&#x7684;&#x5904;&#x7406;&#xFF0C;&#x5199;map&#x6216;&#x8005;reduce&#x65B9;&#x6CD5;&#xFF0C;&#x4F7F;&#x7528;&#x51FD;&#x6570;&#x7F16;&#x7A0B;&#x65B9;&#x5F0F;&#xFF0C;&#x8981;&#x4FDD;&#x8BC1;&#x65E0;&#x72B6;&#x6001;&#xFF0C;&#x540C;&#x65F6;&#x8981;&#x65E0;&#x526F;&#x4F5C;&#x7528;&#x7B49;&#xFF0C;&#x76F8;&#x540C;&#x53C2;&#x6570;&#x4E00;&#x5B9A;&#x6709;&#x76F8;&#x540C;&#x8F93;&#x51FA;&#x3002;&#x5176;&#x4E8C;&#x662F;&#x4FDD;&#x5B58;&#x7528;&#x6237;session&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x5982;&#x679C;session&#x5B58;&#x5728;&#x7F13;&#x5B58;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x5219;&#x662F;&#x6709;&#x88C5;&#x586B;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x7EF4;&#x62A4;&#x4ED6;&#x4EEC;&#xFF0C;&#x5982;&#x679C;&#x653E;&#x5230;cookie&#xFF0C;&#x670D;&#x52A1;&#x7AEF;&#x53EA;&#x53BB;&#x6821;&#x9A8C;&#xFF0C;session&#x670D;&#x52A1;&#x7528;&#x4E8E;&#x751F;&#x6210;cookie&#xFF0C;&#x5219;&#x5C31;&#x53D8;&#x6210;&#x65E0;&#x72B6;&#x6001;&#x670D;&#x52A1;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4E00;&#x5B9A;&#x8981;&#x4F7F;&#x7528;&#x4F1A;&#x8BDD;&#x72B6;&#x6001;&#xFF0C;&#x5219;&#x8003;&#x8651;&#x4F7F;&#x7528;&#x5206;&#x5E03;&#x5F0F;&#x7F13;&#x5B58;&#xFF0C;&#x8682;&#x8681;&#x5C31;&#x662F;&#x8FD9;&#x4E48;&#x505A;&#x7684;&#xFF0C;&#x901A;&#x8FC7;&#x5206;&#x5E03;&#x5F0F;&#x7F13;&#x5B58;tair&#xFF0C;&#x6765;&#x5B58;&#x50A8;session&#x3002;</p>
<h2 id="&#x5F02;&#x6B65;&#x901A;&#x4FE1;"><a href="#&#x5F02;&#x6B65;&#x901A;&#x4FE1;" class="headerlink" title="&#x5F02;&#x6B65;&#x901A;&#x4FE1;"></a>&#x5F02;&#x6B65;&#x901A;&#x4FE1;</h2><p>&#x672C;&#x7AE0;&#x540E;&#x534A;&#x90E8;&#x5206;&#x7684;&#x5185;&#x5BB9;&#x8FC7;&#x4E8E;&#x7406;&#x60F3;&#x5316;&#x4E86;&#xFF0C;&#x5C24;&#x5176;&#x6700;&#x540E;&#x7684;&#x90A3;&#x4E2A;&#x6210;&#x672C;-&#x4EF7;&#x503C;&#x56DB;&#x8C61;&#x9650;&#xFF0C;&#x5176;&#x5B9E;&#x7EF4;&#x5EA6;&#x5355;&#x4E00;&#xFF0C;&#x800C;&#x4E14;&#x6CA1;&#x6709;&#x8003;&#x8651;&#x4EBA;&#x6027;&#xFF08;&#x5927;&#x90E8;&#x5206;&#x4EBA;&#x90FD;&#x662F;&#x4F4E;&#x4F30;&#x6210;&#x672C;&#xFF0C;&#x9AD8;&#x4F30;&#x4EF7;&#x503C;&#xFF09;&#x3002;&#x6240;&#x4EE5;&#x6CA1;&#x6709;&#x53C2;&#x8003;&#x6027;&#x3002;</p>
<p>&#x5F02;&#x6B65;&#x901A;&#x4FE1;&#x8FD9;&#x5757;&#xFF0C;&#x662F;&#x5C5E;&#x4E8E;&#x67B6;&#x6784;&#x4E2D;&#x6700;&#x57FA;&#x672C;&#x5185;&#x5BB9;&#x3002;&#x540C;&#x6B65;&#x8F6C;&#x5F02;&#x6B65;&#xFF0C;&#x589E;&#x52A0;&#x6027;&#x80FD;&#xFF0C;&#x4F46;&#x662F;&#x4F1A;&#x5E26;&#x6765;&#x590D;&#x6742;&#x6027;&#x3002;&#x8FD9;&#x4E2A;&#x5176;&#x5B9E;&#x4E0D;&#x7528;&#x505A;&#x591A;&#x8BF4;&#x660E;&#xFF0C;&#x4F60;&#x5C31;&#x770B;&#x662F;&#x5426;&#x662F;&#x5F3A;&#x5F31;&#x4F9D;&#x8D56;&#x3002;&#x5F3A;&#x4F9D;&#x8D56;&#x57FA;&#x672C;&#x90FD;&#x8981;&#x8D70;&#x540C;&#x6B65;&#xFF0C;&#x5F31;&#x4F9D;&#x8D56;&#x57FA;&#x672C;&#x90FD;&#x53EF;&#x4EE5;&#x8D70;&#x5F02;&#x6B65;&#x3002;&#x7136;&#x540E;&#x518D;&#x8003;&#x8651;&#x6027;&#x80FD;&#x56E0;&#x7D20;&#xFF0C;&#x524A;&#x5CF0;&#x84C4;&#x6D2A;&#xFF0C;&#x5F97;&#x7528;&#x961F;&#x5217;&#x3002;</p>
<p>&#x6D88;&#x606F;&#x961F;&#x5217;&#x6269;&#x5C55;&#x8FD9;&#x91CC;&#xFF0C;&#x5176;&#x5B9E;&#x4E00;&#x822C;&#x505A;&#x6CD5;&#x90FD;&#x662F;&#x5782;&#x76F4;&#x6269;&#x5C55;&#xFF0C;&#x5206;&#x79DF;&#x6237;&#x554A;&#xFF0C;&#x5206;&#x4E1A;&#x52A1;&#x554A;&#xFF0C;2-8&#x539F;&#x5219;&#x554A;&#x7B49;&#x7B49;&#x3002;&#x6309;&#x7167;topic&#x5212;&#x5206;&#x3002;</p>
<h2 id="&#x610F;&#x72B9;&#x672A;&#x5C3D;"><a href="#&#x610F;&#x72B9;&#x672A;&#x5C3D;" class="headerlink" title="&#x610F;&#x72B9;&#x672A;&#x5C3D;"></a>&#x610F;&#x72B9;&#x672A;&#x5C3D;</h2><p>&#x51E0;&#x70B9;&#xFF0C;&#x4E00;&#x662F;&#x9632;&#x6B62;&#x88AB;&#x4F9B;&#x5E94;&#x5546;&#x904F;&#x5236;&#x54BD;&#x5589;&#xFF08;&#x8FD9;&#x91CC;&#x4E00;&#x822C;&#x662F;CTO&#x51B3;&#x7B56;&#x5C42;&#x4E86;&#xFF09;&#x3002;&#x800C;&#x662F;&#x5206;&#x7EA7;&#x5B58;&#x50A8;+&#x5206;&#x7EA7;&#x5904;&#x7406;&#x8D1F;&#x8F7D;&#x3002;&#x8FD9;&#x4E2A;&#x6BD4;&#x8F83;&#x6709;&#x7528;&#xFF0C;&#x5206;&#x7EA7;&#x5B58;&#x50A8;&#x4E3B;&#x8981;&#x770B;&#x4F60;&#x6570;&#x636E;&#x7684;&#x4EF7;&#x503C;+&#x8BBF;&#x95EE;&#x9891;&#x6B21;&#x3002;&#x6709;&#x4E00;&#x4E2A;&#x4EF7;&#x503C;+&#x6210;&#x672C;&#x66F2;&#x7EBF;&#xFF0C;&#x8FD9;&#x4E2A;&#x503C;&#x5F97;&#x5B66;&#x4E60;&#xFF0C;&#x4E5F;&#x662F;&#x67B6;&#x6784;&#x5E08;&#x6210;&#x672C;&#x6536;&#x76CA;&#x601D;&#x7EF4;&#x7684;&#x4E00;&#x4E2A;&#x5178;&#x578B;&#x5E94;&#x7528;&#x3002;&#x5176;&#x4E8C;&#x662F;&#x5206;&#x7EA7;&#x5904;&#x7406;&#x8D1F;&#x8F7D;&#xFF0C;&#x8FD9;&#x4E2A;&#x6BD4;&#x5982;&#x963F;&#x91CC;&#x641E;&#x7684;&#x79BB;&#x7EBF;&#x5728;&#x7EBF;&#x6DF7;&#x90E8;&#x7B49;&#x7B49;&#x3002;&#x4E0D;&#x540C;&#x4E1A;&#x52A1;&#x7C7B;&#x578B;&#x7528;&#x4E0D;&#x540C;&#x7684;&#x673A;&#x5668;&#x7B49;&#x3002;</p>
<p>&#x5B8C;&#x5584;&#x76D1;&#x63A7;&#xFF0C;&#x8FD9;&#x4E2A;&#x4E5F;&#x662F;&#x67B6;&#x6784;&#x5E08;&#x5FC5;&#x987B;&#x77E5;&#x9053;&#x7684;&#xFF0C;&#x751A;&#x81F3;&#x662F;&#x5E38;&#x8BC6;&#x3002;&#x65E0;&#x8BBA;&#x600E;&#x4E48;&#x6837;&#x7684;&#x7CFB;&#x7EDF;&#xFF0C;&#x90FD;&#x4E00;&#x5B9A;&#x8981;&#x6709;&#x76D1;&#x63A7;&#xFF0C;&#x751A;&#x81F3;&#x76D1;&#x63A7;&#x7CFB;&#x7EDF;&#x4E5F;&#x8981;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x76D1;&#x63A7;&#x3002;&#x81F3;&#x4E8E;&#x76D1;&#x63A7;&#x7684;&#x7EF4;&#x5EA6;&#xFF0C;&#x5185;&#x5BB9;&#xFF0C;&#x601D;&#x60F3;&#xFF0C;&#x5219;&#x90FD;&#x662F;&#x7ECF;&#x9A8C;&#x79EF;&#x7D2F;&#x4E86;&#x3002;</p>
<p>&#x4FDD;&#x6301;&#x7ADE;&#x4E89;&#x529B;&#x3002;&#x3002;&#x3002;&#x8FD9;&#x4E2A;&#x5C31;&#x865A;&#x4E86;&#x70B9;&#x3002;&#x56E0;&#x4E3A;&#x7ADE;&#x4E89;&#x529B;&#x662F;&#x66F4;&#x6210;&#x672C;&#x6709;&#x5173;&#x7CFB;&#x7684;&#x3002;&#x4F60;&#x8981;&#x4FDD;&#x6301;&#x7ADE;&#x4E89;&#x529B;&#xFF0C;&#x5FC5;&#x7136;&#x8981;&#x6295;&#x5165;&#x6210;&#x672C;&#x3002;&#x6240;&#x4EE5;&#x4E0D;&#x662F;&#x60F3;&#x4FDD;&#x6301;&#x5C31;&#x4FDD;&#x6301;&#x7684;&#x3002;&#x4E5F;&#x8981;&#x6709;&#x6295;&#x5165;&#x4EA7;&#x51FA;&#x6BD4;&#x3002;&#x6838;&#x5FC3;&#x6280;&#x672F;&#xFF0C;&#x4E00;&#x5B9A;&#x8981;&#x4FDD;&#x6301;&#x7ADE;&#x4E89;&#x529B;&#xFF0C;&#x6210;&#x672C;&#x6295;&#x5165;&#x5230;&#x8FD9;&#x91CC;&#x3002;&#x975E;&#x6838;&#x5FC3;&#x6280;&#x672F;&#xFF0C;&#x4F5C;&#x4E3A;&#x516C;&#x53F8;&#x5F71;&#x54CD;&#x529B;&#x548C;&#x6280;&#x672F;&#x5F62;&#x8C61;&#x7684;&#x4E00;&#x79CD;&#xFF0C;&#x7C7B;&#x4F3C;&#x516C;&#x76CA;&#x6D3B;&#x52A8;&#x3002;&#x3002;</p>
<p>&#x603B;&#x7ED3;&#xFF0C;&#x4E0D;&#x5426;&#x5B9A;&#x672C;&#x4E66;&#x4F5C;&#x8005;&#x80FD;&#x529B;&#x4EE5;&#x53CA;&#x672C;&#x4E66;&#x4EF7;&#x503C;&#x3002;&#x5BF9;&#x4E8E;&#x56FD;&#x5185;&#x5927;&#x90E8;&#x5206;&#x8BFB;&#x8005;&#x6765;&#x8BB2;&#xFF0C;&#x5E94;&#x8BE5;&#x662F;&#x8BFB;&#x4E0D;&#x61C2;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x6BD5;&#x7ADF;&#x8FD9;&#x672C;&#x4E66;&#x662F;&#x7AD9;&#x5728;&#x4E00;&#x4E2A;&#x66F4;&#x9AD8;&#x7684;&#x5C42;&#x6B21;&#x6765;&#x5199;&#x7684;&#xFF0C;&#x9762;&#x5411;&#x7684;&#x90FD;&#x662F;CTO&#x6216;&#x8005;&#x5927;&#x516C;&#x53F8;&#x603B;&#x76D1;&#xFF0C;&#x81F3;&#x5C11;&#x7ECF;&#x5386;&#x8FC7;&#x516C;&#x53F8;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x4ECE;&#x96F6;&#x5230;&#x6709;&#x7684;&#x8FC7;&#x7A0B;&#x3002;&#x6709;&#x4E9B;&#x601D;&#x60F3;&#x5F88;&#x503C;&#x5F97;&#x501F;&#x9274;&#xFF0C;&#x6BD4;&#x5982;AKF&#x77E9;&#x9635;&#xFF0C;&#x5173;&#x4E8E;&#x6DF1;&#x5EA6;&#x5E7F;&#x5EA6;&#x7684;&#x601D;&#x8003;&#x7B49;&#x7B49;&#x3002;&#x6709;&#x4E9B;&#x5219;&#x6BD4;&#x8F83;&#x8FC7;&#x65F6;&#x4E86;&#xFF0C;&#x6BD4;&#x5982;cookie&#x5927;&#x5C0F;&#x95EE;&#x9898;&#xFF08;&#x5176;&#x5B9E;&#x53EF;&#x4EE5;&#x91C7;&#x7528;localStorage&#xFF09;&#xFF0C;&#x6BD4;&#x5982;&#x73B0;&#x5728;&#x65E9;&#x90FD;&#x5DF2;&#x7ECF;&#x8FDB;&#x5165;&#x79FB;&#x52A8;&#x4E92;&#x8054;&#x7F51;&#x65F6;&#x4EE3;&#x4E86;&#xFF0C;&#x8FD8;&#x5728;&#x8BA8;&#x8BBA;web&#x7684;&#x76F8;&#x5173;&#x6280;&#x672F;&#x7B49;&#x7B49;&#xFF0C;&#x8BA9;&#x6211;&#x89C9;&#x5F97;&#xFF0C;&#x5176;&#x5B9E;&#x4E2D;&#x56FD;&#x6280;&#x672F;&#x5708;&#x4ECE;&#x5B9E;&#x6218;&#x5230;&#x5DE5;&#x7A0B;&#x7406;&#x8BBA;&#xFF0C;&#x5DF2;&#x7ECF;&#x4E0D;&#x6BD4;&#x7845;&#x8C37;&#x90A3;&#x5E2E;&#x5B50;&#x5DE5;&#x7A0B;&#x5E08;&#x5DEE;&#x591A;&#x5C11;&#x4E86;&#x3002;&#x60F3;&#x60F3;&#x6BCF;&#x5E74;&#x7684;&#x53CC;&#x5341;&#x4E00;&#xFF0C;618&#x7B49;&#x5927;&#x4FC3;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x89C1;&#x8BC6;&#x5DF2;&#x7ECF;&#x4E0D;&#x5728;&#x6D45;&#x8584;&#xFF0C;&#x5DE5;&#x7A0B;&#x6280;&#x672F;&#x80FD;&#x529B;&#xFF0C;&#x5DF2;&#x7ECF;&#x4E0D;&#x5728;&#x843D;&#x540E;&#xFF0C;&#x751A;&#x81F3;&#x8D85;&#x8FC7;&#x4E86;&#x7F8E;&#x56FD;&#x7684;&#x5F88;&#x591A;&#x5927;&#x516C;&#x53F8;&#x3002;&#x4F46;&#x4E2D;&#x56FD;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x57FA;&#x7840;&#x7814;&#x7A76;&#xFF0C;&#x8FD8;&#x662F;&#x5F88;&#x8584;&#x5F31;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x5728;&#x5BF9;&#x7406;&#x8BBA;&#x7B97;&#x6CD5;&#x548C;&#x884C;&#x4E1A;&#x6807;&#x51C6;&#x5236;&#x5B9A;&#x4E0A;&#x843D;&#x540E;&#x5F88;&#x591A;&#x3002;&#x5DE5;&#x7A0B;&#x80FD;&#x529B;&#x5F3A;&#x4E5F;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x65B9;&#x9762;&#x7684;&#x4F53;&#x73B0;&#x7F62;&#x4E86;&#x3002;</p>

                
  <!-- css -->
  <style type="text/css">
      .center {
          text-align: center;
      }
      .hidden {
          display: none;
      }
    .donate_bar a.btn_donate{
      display: inline-block;
      width: 82px;
      height: 82px;
      background: url("http://7xsl28.com1.z0.glb.clouddn.com/btn_reward.gif") no-repeat;
      _background: url("http://7xsl28.com1.z0.glb.clouddn.com/btn_reward.gif") no-repeat;

      <!-- http://img.t.sinajs.cn/t5/style/images/apps_PRF/e_media/btn_reward.gif
           因为本 hexo 生成的博客所用的 theme 的 a:hover 带动画效果，
         为了在让打赏按钮显示效果正常 而 添加了以下几行 css，
         嵌入其它博客时不一定要它们。 -->
      -webkit-transition: background 0s;
      -moz-transition: background 0s;
      -o-transition: background 0s;
      -ms-transition: background 0s;
      transition: background 0s;
      <!-- /让打赏按钮的效果显示正常 而 添加的几行 css 到此结束 -->
    }

    .donate_bar a.btn_donate:hover{ background-position: 0px -82px;}
    .donate_bar .donate_txt {
      display: block;
      color: #9d9d9d;
      font: 14px/2 "Microsoft Yahei";
    }
    .bold{ font-weight: bold; }
  </style>
  <!-- /css -->

    <!-- Donate Module -->
  <div id="donate_module">

  <!-- btn_donate & tips -->
  <div id="donate_board" class="donate_bar center">
      <br>
      ------------------------------------------------------------------------------------------------------------------------------
      <br>
    <a id="btn_donate" class="btn_donate" target="_self" href="javascript:;" title="Donate 打赏"></a>
    <span class="donate_txt">
      Enjoy it ? Donate me !  欣赏此文？求鼓励，求支持！
    </span>


  </div>
  <!-- /btn_donate & tips -->

  <!-- donate guide -->

  <div id="donate_guide" class="donate_bar center hidden">
        <br>
        <br>

    <a href="/img/wechat_pay.jpg" title="用微信扫一扫哦~" class="fancybox" rel="article0">
      <img src="/img/wechat_pay.jpg" title="微信打赏 Colin" height="190px" width="auto"/>
    </a>

        &nbsp;&nbsp;

    <!-- <a href="undefined" title="用支付宝扫一扫即可~" class="fancybox" rel="article0">
      <img src="undefined" title="支付宝打赏 Colin" height="190px" width="auto"/>
    </a> -->

    <span class="donate_txt">
      Enjoy it ? Donate me !  欣赏此文？求鼓励，求支持！
    </span>

  </div>
  <!-- /donate guide -->

  <!-- donate script -->
  <script type="text/javascript">
    document.getElementById('btn_donate').onclick = function() {
      $('#donate_board').addClass('hidden');
      $('#donate_guide').removeClass('hidden');
    }

    function donate_on_web(){
      $('#donate').submit();
        }

    var original_window_onload = window.onload;
        window.onload = function () {
            if (original_window_onload) {
                original_window_onload();
            }
            document.getElementById('donate_board_wdg').className = 'hidden';
    }
  </script>
  <!-- /donate script -->
</div>
<!-- /Donate Module -->
   

 </br>
 </br>

             
                <ul class="pager">
                    
                    
                        <li class="next">
                            <a href="/git-reflog/" data-toggle="tooltip" data-placement="top" title="回滚一个丢失的merge">Next Post &rarr;</a>
                        </li>
                    
                </ul>

                

            </div>
    <!-- Side Catalog Container -->
        

    <!-- Sidebar Container -->

            <div class="
                col-lg-8 col-lg-offset-2
                col-md-10 col-md-offset-1
                sidebar-container">

                <!-- Featured Tags -->
                
                <section>
                    <!-- no hr -->
                    <h5><a href="/tags/">FEATURED TAGS</a></h5>
                    <div class="tags">
                       
                          <a class="tag" href="/tags/#架构" title="架构">架构</a>
                        
                    </div>
                </section>
                

                <!-- Friends Blog -->
                
                <hr>
                <h5>FRIENDS</h5>
                <ul class="list-inline">

                    
                        <li><a href="http://youdang.github.io" target="_blank">youdang&#39;s Blog</a></li>
                    
                </ul>
                
            </div>

        </div>
    </div>
</article>







<!-- async load function -->
<script>
    function async(u, c) {
      var d = document, t = 'script',
          o = d.createElement(t),
          s = d.getElementsByTagName(t)[0];
      o.src = u;
      if (c) { o.addEventListener('load', function (e) { c(null, e); }, false); }
      s.parentNode.insertBefore(o, s);
    }
</script>
<!-- anchor-js, Doc:http://bryanbraun.github.io/anchorjs/ -->
<script>
    async("http://cdn.bootcss.com/anchor-js/1.1.1/anchor.min.js",function(){
        anchors.options = {
          visible: 'always',
          placement: 'right',
          icon: '#'
        };
        anchors.add().remove('.intro-header h1').remove('.subheading').remove('.sidebar-container h5');
    })
</script>
<style>
    /* place left on bigger screen */
    @media all and (min-width: 800px) {
        .anchorjs-link{
            position: absolute;
            left: -0.75em;
            font-size: 1.1em;
            margin-top : -0.1em;
        }
    }
</style>



    <!-- Footer -->
    <!-- Footer -->
<footer>
    <div class="container">
        <div class="row">
            <div class="col-lg-8 col-lg-offset-2 col-md-10 col-md-offset-1">
                <ul class="list-inline text-center">
                
                
                    <li>
                        <a target="_blank" href="https://twitter.com/TooBusyTooLazy">
                            <span class="fa-stack fa-lg">
                                <i class="fa fa-circle fa-stack-2x"></i>
                                <i class="fa fa-twitter fa-stack-1x fa-inverse"></i>
                            </span>
                        </a>
                    </li>
                
                
                    <li>
                        <a target="_blank" href="https://www.zhihu.com/people/zhang-yan-32-14">
                            <span class="fa-stack fa-lg">
                                <i class="fa fa-circle fa-stack-2x"></i>
                                <i class="fa  fa-stack-1x fa-inverse">知</i>
                            </span>
                        </a>
                    </li>
                

                
                    <li>
                        <a target="_blank" href="http://weibo.com/kriszhang123">
                            <span class="fa-stack fa-lg">
                                <i class="fa fa-circle fa-stack-2x"></i>
                                <i class="fa fa-weibo fa-stack-1x fa-inverse"></i>
                            </span>
                        </a>
                    </li>
                

                
                    <li>
                        <a target="_blank" href="https://www.facebook.com/zhangyan985">
                            <span class="fa-stack fa-lg">
                                <i class="fa fa-circle fa-stack-2x"></i>
                                <i class="fa fa-facebook fa-stack-1x fa-inverse"></i>
                            </span>
                        </a>
                    </li>
                

                
                    <li>
                        <a target="_blank"  href="https://github.com/kris-zhang">
                            <span class="fa-stack fa-lg">
                                <i class="fa fa-circle fa-stack-2x"></i>
                                <i class="fa fa-github fa-stack-1x fa-inverse"></i>
                            </span>
                        </a>
                    </li>
                

                
                    <li>
                        <a target="_blank"  href="https://www.linkedin.com/in/岩-张-83aa7a121">
                            <span class="fa-stack fa-lg">
                                <i class="fa fa-circle fa-stack-2x"></i>
                                <i class="fa fa-linkedin fa-stack-1x fa-inverse"></i>
                            </span>
                        </a>
                    </li>
                

                </ul>
                <p class="copyright text-muted">
                    Copyright &copy; Kris&#39; Blog 2018 
                    <br>
                    Theme by <a href="http://huangxuan.me">Hux</a> 
                    <span style="display: inline-block; margin: 0 5px;">
                        <i class="fa fa-heart"></i>
                    </span> 
                    Ported by <a href="http://blog.kaijun.rocks">Kaijun</a> | 
                    <iframe
                        style="margin-left: 2px; margin-bottom:-5px;"
                        frameborder="0" scrolling="0" width="91px" height="20px"
                        src="https://ghbtns.com/github-btn.html?user=kaijun&repo=hexo-theme-huxblog&type=star&count=true" >
                    </iframe>
                </p>
            </div>
        </div>
    </div>
</footer>

<!-- jQuery -->
<script src="/js/jquery.min.js"></script>

<!-- Bootstrap Core JavaScript -->
<script src="/js/bootstrap.min.js"></script>

<!-- Custom Theme JavaScript -->
<script src="/js/hux-blog.min.js"></script>


<!-- async load function -->
<script>
    function async(u, c) {
      var d = document, t = 'script',
          o = d.createElement(t),
          s = d.getElementsByTagName(t)[0];
      o.src = u;
      if (c) { o.addEventListener('load', function (e) { c(null, e); }, false); }
      s.parentNode.insertBefore(o, s);
    }
</script>

<!-- 
     Because of the native support for backtick-style fenced code blocks 
     right within the Markdown is landed in Github Pages, 
     From V1.6, There is no need for Highlight.js, 
     so Huxblog drops it officially.

     - https://github.com/blog/2100-github-pages-now-faster-and-simpler-with-jekyll-3-0  
     - https://help.github.com/articles/creating-and-highlighting-code-blocks/    
-->
<!--
    <script>
        async("http://cdn.bootcss.com/highlight.js/8.6/highlight.min.js", function(){
            hljs.initHighlightingOnLoad();
        })
    </script>
    <link href="http://cdn.bootcss.com/highlight.js/8.6/styles/github.min.css" rel="stylesheet">
-->


<!-- jquery.tagcloud.js -->
<script>
    // only load tagcloud.js in tag.html
    if($('#tag_cloud').length !== 0){
        async("kriszhang.com/js/jquery.tagcloud.js",function(){
            $.fn.tagcloud.defaults = {
                //size: {start: 1, end: 1, unit: 'em'},
                color: {start: '#bbbbee', end: '#0085a1'},
            };
            $('#tag_cloud a').tagcloud();
        })
    }
</script>

<!--fastClick.js -->
<script>
    async("http://cdn.bootcss.com/fastclick/1.0.6/fastclick.min.js", function(){
        var $nav = document.querySelector("nav");
        if($nav) FastClick.attach($nav);
    })
</script>


<!-- Google Analytics -->


<script>
    // dynamic User by Hux
    var _gaId = 'UA-49627206-1';
    var _gaDomain = 'huangxuan.me';

    // Originial
    (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
    (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
    m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
    })(window,document,'script','//www.google-analytics.com/analytics.js','ga');

    ga('create', _gaId, _gaDomain);
    ga('send', 'pageview');
</script>




<!-- Baidu Tongji -->

<script>
    // dynamic User by Hux
    var _baId = '4cc1f2d8f3067386cc5cdb626a202900';

    // Originial
    var _hmt = _hmt || [];
    (function() {
      var hm = document.createElement("script");
      hm.src = "//hm.baidu.com/hm.js?" + _baId;
      var s = document.getElementsByTagName("script")[0];
      s.parentNode.insertBefore(hm, s);
    })();
</script>


<!-- Side Catalog -->





<!-- Image to hack wechat -->
<img src="kriszhang.com/undefined" width="0" height="0" />
<!-- Migrate from head to bottom, no longer block render and still work --><!-- hexo-inject:begin --><!-- Begin: Injected MathJax -->
<script type="text/x-mathjax-config">
  MathJax.Hub.Config({"tex2jax":{"inlineMath":[["$","$"],["\\(","\\)"]],"skipTags":["script","noscript","style","textarea","pre","code"],"processEscapes":true},"TeX":{"equationNumbers":{"autoNumber":"AMS"}}});
</script>

<script type="text/x-mathjax-config">
  MathJax.Hub.Queue(function() {
    var all = MathJax.Hub.getAllJax(), i;
    for(i=0; i < all.length; i += 1) {
      all[i].SourceElement().parentNode.className += ' has-jax';
    }
  });
</script>

<script type="text/javascript" src="//cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML">
</script>
<!-- End: Injected MathJax -->
<!-- hexo-inject:end -->

</body>

</html>
